package com.skyPro.Algaritm24.Service;

import org.junit.jupiter.api.Test;

import static org.junit.jupiter.api.Assertions.*;

class StringListImpTest {

    @Test
    void add() {
        //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста

    }

    @Test
    void testAdd() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void remove() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void testRemove() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void contains() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void indexOf() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void lastIndexOf() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void get() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void set() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void testEquals() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void size() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void isEmpty() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void clear() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }

    @Test
    void toArray() {  //подготовка входных данных
        //подготовка ожидаемого результата
        //начало теста
    }
}